//MULTG030       JOB  1,NOTIFY=&SYSUID
//STEP1          EXEC PGM=ICEGENER
//SYSUT1         DD DSN=UNTG030.COBOLIN(AUTODATA),DISP=SHR
//SYSUT2         DD DSN=UNTG030.COBOLOUT(GENEROUT),DISP=SHR
//SYSPRINT       DD SYSOUT=*
//SYSIN          DD DUMMY
//STEP2 	     EXEC PGM=IDCAMS
//SYSPRINT	     DD SYSOUT=*
//SYSIN     	 DD *
    DELETE   UNTG030.COBOLIN(AUTONEW) 
/*
//STEP3 	     EXEC PGM=IDCAMS
//SYSPRINT	     DD SYSOUT=*
//SYSIN     	 DD *
    DELETE   UNTG030.COBOLIN(NEWLIST) 
/*
//STEP4 	     EXEC PGM=IDCAMS
//SYSPRINT	     DD SYSOUT=*
//SYSIN     	 DD *
    DELETE   UNTG030.COBOLIN(FINALCAR) 
    DELETE   UNTG030.COBOLIN(ITDSDATA) 
/*
//STEP5    	     EXEC PGM=IDCAMS
//SYSPRINT	     DD SYSOUT=*
//OLDINV    	 DD DSN=UNTG030.COBOLIN(AUTODATA),DISP=SHR
//NEWINV   	     DD DSN=UNTG030.COBOLIN(AUTONEW),DISP=SHR
//SYSIN       	 DD *
    REPRO    INFILE(OLDINV)    OUTFILE(NEWINV)
/*
//STEP6		     EXEC PGM=IDCAMS
//SYSPRINT	     DD  SYSOUT=*
//STUFF		     DD DSN=UNTG030.COBOLIN(AUTONEW),DISP=SHR
//SYSIN		     DD  *
	PRINT    INFILE(STUFF) CHAR
/*
//STEP7  		EXEC PGM=IKJEFT01
//SYSPRINT		DD SYSOUT=*
//SYSTSPRT		DD SYSOUT=*
//SYSTSIN		DD *
    RENAME	'UNTG030.COBOLIN(AUTONEW)' 'UNTG030.COBOLIN(ITDSDATA)'
/*
//STEP8		     EXEC PGM=IDCAMS
//SYSPRINT	     DD  SYSOUT=*
//STUFF		     DD DSN=UNTG030.COBOLIN(ITDSDATA),DISP=SHR
//SYSIN		     DD  *
	PRINT    INFILE(STUFF) CHAR
/*
//STEP9    	     EXEC PGM=IDCAMS
//SYSPRINT	     DD SYSOUT=*
//OLDINV    	 DD DSN=UNTG030.COBOLIN(ITDSDATA),DISP=SHR
//NEWINV   	     DD DSN=UNTG030.COBOLIN(NEWLIST),DISP=SHR
//SYSIN       	 DD *
    REPRO    INFILE(OLDINV)    OUTFILE(NEWINV)
/*
//STEP10		 EXEC PGM=IDCAMS
//SYSPRINT	     DD  SYSOUT=*
//STUFF		     DD DSN=UNTG030.COBOLIN(NEWLIST),DISP=SHR
//SYSIN		     DD  *
	PRINT    INFILE(STUFF) CHAR
/*
//STEP11  		EXEC PGM=IKJEFT01
//SYSPRINT		DD SYSOUT=*
//SYSTSPRT		DD SYSOUT=*
//SYSTSIN		DD *
    RENAME	'UNTG030.COBOLIN(NEWLIST)' 'UNTG030.COBOLIN(FINALCAR)'
/*
//STEP12		 EXEC PGM=IDCAMS
//SYSPRINT	     DD  SYSOUT=*
//STUFF		     DD DSN=UNTG030.COBOLIN(FINALCAR),DISP=SHR
//SYSIN		     DD  *
	PRINT    INFILE(STUFF) CHAR
/*
//STEP13 	     EXEC PGM=IDCAMS
//SYSPRINT	     DD SYSOUT=*
//SYSIN     	 DD *
    DELETE   UNTG030.COBOLIN(ITDSDATA) 
/*
//